<?php

use Illuminate\Database\Seeder;

class NeighborhoodTableSeeder extends Seeder {
	/**
	 * Run the database seeds.
	 *
	 * @return void
	 */
	public function run() {
		$neighborhoods = ['Автокоманда', 'Аеродром' , 'Бутел I', 'Бутел II', 'Влае', 'Водно', 'Волково',' Гази Баба', 'Горно Лисиче' , 'Гоце Делчев', 'Даме Груев', 'Дебар Маало', 'Дексион', 'Драчево', 'Ѓорче Петров', 'Жданец', 'Железара', 'Злокуќани', 'Илинден', 'Јане Сандански', 'Капиштец', 'Карпош I', 'Карпош II', 'Карпош III', 'Карпош IV', 'Кисела Вода', 'Кисела Јабука', 'Козле', 'Колонија Идризово', 'Крњево Маало', 'населба Лисиче', 'Ченто (Сингелиќ)', 'Маџари', 'Маџир Маало', 'Миладиновци', 'Мичурин', М'омин Поток', 'Ново Лисиче', 'Пинтија', 'Острово', 'Пржино', 'Припор', 'Пролет', 'Радишани', 'Скопје Север', 'Сопиште', 'Стајковци', 'Тафталиџе', 'Топанско Поле', 'Ќерамидница', 'Хиподром', 'Центар', 'Црниче', 'Чаир', 'Шуто Оризари'.];

		foreach ($neighborhoods as $neighborhood) {
			$nneighborhoodModel      = new Neighborhood();
			$neighborhoodModel->name = $neighborhood;
			$neighborhoodModel->save();
		}
	}
}